RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f10x_dma.c
  if ((tmpreg & DMAy_FLAG) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  
  return  bitstatus;
}


/********************************************************************************
* Function Name  : DMA_ClearFlag
* Description    : Clears the DMAy Channelx's pending flags.
* Input          : DMAy_FLAG: specifies the flag to check.
*                      DMA1_FLAG_GL1: DMA1 Channel1 global flag. 
*                      DMA1_FLAG_TC1: DMA1 Channel1 transfer complete flag.
*                      DMA1_FLAG_HT1: DMA1 Channel1 half transfer flag.
*                      DMA1_FLAG_TE1: DMA1 Channel1 transfer error flag.
*                      DMA1_FLAG_GL2: DMA1 Channel2 global flag.
*                      DMA1_FLAG_TC2: DMA1 Channel2 transfer complete flag.
*                      DMA1_FLAG_HT2: DMA1 Channel2 half transfer flag.
*                      DMA1_FLAG_TE2: DMA1 Channel2 transfer error flag.
*                      DMA1_FLAG_GL3: DMA1 Channel3 global flag.
*                      DMA1_FLAG_TC3: DMA1 Channel3 transfer complete flag.
*                      DMA1_FLAG_HT3: DMA1 Channel3 half transfer flag.
*                      DMA1_FLAG_TE3: DMA1 Channel3 transfer error flag.
*                      DMA1_FLAG_GL4: DMA1 Channel4 global flag.
*                      DMA1_FLAG_TC4: DMA1 Channel4 transfer complete flag.
*                      DMA1_FLAG_HT4: DMA1 Channel4 half transfer flag.
*                      DMA1_FLAG_TE4: DMA1 Channel4 transfer error flag.
*                      DMA1_FLAG_GL5: DMA1 Channel5 global flag.
*                      DMA1_FLAG_TC5: DMA1 Channel5 transfer complete flag.
*                      DMA1_FLAG_HT5: DMA1 Channel5 half transfer flag.
*                      DMA1_FLAG_TE5: DMA1 Channel5 transfer error flag.
*                      DMA1_FLAG_GL6: DMA1 Channel6 global flag.
*                      DMA1_FLAG_TC6: DMA1 Channel6 transfer complete flag.
*                      DMA1_FLAG_HT6: DMA1 Channel6 half transfer flag.
*                      DMA1_FLAG_TE6: DMA1 Channel6 transfer error flag.
*                      DMA1_FLAG_GL7: DMA1 Channel7 global flag.
*                      DMA1_FLAG_TC7: DMA1 Channel7 transfer complete flag.
*                      DMA1_FLAG_HT7: DMA1 Channel7 half transfer flag.
*                      DMA1_FLAG_TE7: DMA1 Channel7 transfer error flag.
*                      DMA2_FLAG_GL1: DMA2 Channel1 global flag.
*                      DMA2_FLAG_TC1: DMA2 Channel1 transfer complete flag.
*                      DMA2_FLAG_HT1: DMA2 Channel1 half transfer flag.
*                      DMA2_FLAG_TE1: DMA2 Channel1 transfer error flag.
*                      DMA2_FLAG_GL2: DMA2 Channel2 global flag.
*                      DMA2_FLAG_TC2: DMA2 Channel2 transfer complete flag.
*                      DMA2_FLAG_HT2: DMA2 Channel2 half transfer flag.
*                      DMA2_FLAG_TE2: DMA2 Channel2 transfer error flag.
*                      DMA2_FLAG_GL3: DMA2 Channel3 global flag.
*                      DMA2_FLAG_TC3: DMA2 Channel3 transfer complete flag.
*                      DMA2_FLAG_HT3: DMA2 Channel3 half transfer flag.
*                      DMA2_FLAG_TE3: DMA2 Channel3 transfer error flag.
*                      DMA2_FLAG_GL4: DMA2 Channel4 global flag.
*                      DMA2_FLAG_TC4: DMA2 Channel4 transfer complete flag.
*                      DMA2_FLAG_HT4: DMA2 Channel4 half transfer flag.
*                      DMA2_FLAG_TE4: DMA2 Channel4 transfer error flag.
*                      DMA2_FLAG_GL5: DMA2 Channel5 global flag.
*                      DMA2_FLAG_TC5: DMA2 Channel5 transfer complete flag.
*                      DMA2_FLAG_HT5: DMA2 Channel5 half transfer flag.
*                      DMA2_FLAG_TE5: DMA2 Channel5 transfer error flag.
* Return         : NONE 
*********************************************************************************/
void DMA_ClearFlag(uint32_t DMAy_FLAG)
{
  if ((DMAy_FLAG & FLAG_Mask) != (uint32_t)RESET)
  {
    DMA2->INTFCR = DMAy_FLAG;
  }
  else
  {
    DMA1->INTFCR = DMAy_FLAG;
  }
}

/********************************************************************************
* Function Name  : DMA_GetITStatus
* Description    : Checks whether the specified DMAy Channelx interrupt has occurred 
*                  or not.
* Input          : DMAy_IT: specifies the DMAy interrupt source to check. 
*                      DMA1_IT_GL1: DMA1 Channel1 global flag. 
*                      DMA1_IT_TC1: DMA1 Channel1 transfer complete flag.
*                      DMA1_IT_HT1: DMA1 Channel1 half transfer flag.
*                      DMA1_IT_TE1: DMA1 Channel1 transfer error flag.
*                      DMA1_IT_GL2: DMA1 Channel2 global flag.
*                      DMA1_IT_TC2: DMA1 Channel2 transfer complete flag.
*                      DMA1_IT_HT2: DMA1 Channel2 half transfer flag.
*                      DMA1_IT_TE2: DMA1 Channel2 transfer error flag.
*                      DMA1_IT_GL3: DMA1 Channel3 global flag.
*                      DMA1_IT_TC3: DMA1 Channel3 transfer complete flag.
*                      DMA1_IT_HT3: DMA1 Channel3 half transfer flag.
*                      DMA1_IT_TE3: DMA1 Channel3 transfer error flag.
*                      DMA1_IT_GL4: DMA1 Channel4 global flag.
*                      DMA1_IT_TC4: DMA1 Channel4 transfer complete flag.
*                      DMA1_IT_HT4: DMA1 Channel4 half transfer flag.
*                      DMA1_IT_TE4: DMA1 Channel4 transfer error flag.
*                      DMA1_IT_GL5: DMA1 Channel5 global flag.
*                      DMA1_IT_TC5: DMA1 Channel5 transfer complete flag.
*                      DMA1_IT_HT5: DMA1 Channel5 half transfer flag.
*                      DMA1_IT_TE5: DMA1 Channel5 transfer error flag.
*                      DMA1_IT_GL6: DMA1 Channel6 global flag.
*                      DMA1_IT_TC6: DMA1 Channel6 transfer complete flag.
*                      DMA1_IT_HT6: DMA1 Channel6 half transfer flag.
*                      DMA1_IT_TE6: DMA1 Channel6 transfer error flag.
*                      DMA1_IT_GL7: DMA1 Channel7 global flag.
*                      DMA1_IT_TC7: DMA1 Channel7 transfer complete flag.
*                      DMA1_IT_HT7: DMA1 Channel7 half transfer flag.
*                      DMA1_IT_TE7: DMA1 Channel7 transfer error flag.
*                      DMA2_IT_GL1: DMA2 Channel1 global flag.
*                      DMA2_IT_TC1: DMA2 Channel1 transfer complete flag.
*                      DMA2_IT_HT1: DMA2 Channel1 half transfer flag.
*                      DMA2_IT_TE1: DMA2 Channel1 transfer error flag.
*                      DMA2_IT_GL2: DMA2 Channel2 global flag.
*                      DMA2_IT_TC2: DMA2 Channel2 transfer complete flag.
*                      DMA2_IT_HT2: DMA2 Channel2 half transfer flag.
*                      DMA2_IT_TE2: DMA2 Channel2 transfer error flag.
*                      DMA2_IT_GL3: DMA2 Channel3 global flag.
*                      DMA2_IT_TC3: DMA2 Channel3 transfer complete flag.
*                      DMA2_IT_HT3: DMA2 Channel3 half transfer flag.
*                      DMA2_IT_TE3: DMA2 Channel3 transfer error flag.
*                      DMA2_IT_GL4: DMA2 Channel4 global flag.
*                      DMA2_IT_TC4: DMA2 Channel4 transfer complete flag.
*                      DMA2_IT_HT4: DMA2 Channel4 half transfer flag.
*                      DMA2_IT_TE4: DMA2 Channel4 transfer error flag.
*                      DMA2_IT_GL5: DMA2 Channel5 global flag.
*                      DMA2_IT_TC5: DMA2 Channel5 transfer complete flag.
*                      DMA2_IT_HT5: DMA2 Channel5 half transfer flag.
*                      DMA2_IT_TE5: DMA2 Channel5 transfer error flag.
* Return         : The new state of DMAy_IT (SET or RESET). 
*********************************************************************************/ 
ITStatus DMA_GetITStatus(uint32_t DMAy_IT)
{
  ITStatus bitstatus = RESET;
  uint32_t tmpreg = 0;

