RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f10x_dma.c
  if ((DMAy_IT & FLAG_Mask) != (uint32_t)RESET)
  {
    tmpreg = DMA2->INTFR;
  }
  else
  {
    tmpreg = DMA1->INTFR;
  }

  if ((tmpreg & DMAy_IT) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  return  bitstatus;
}


/********************************************************************************
* Function Name  : DMA_ClearITPendingBit
* Description    : Clears the DMAy Channelx's interrupt pending bits.
* Input          : DMAy_IT: specifies the DMAy interrupt source to check. 
*                      DMA1_IT_GL1: DMA1 Channel1 global flag. 
*                      DMA1_IT_TC1: DMA1 Channel1 transfer complete flag.
*                      DMA1_IT_HT1: DMA1 Channel1 half transfer flag.
*                      DMA1_IT_TE1: DMA1 Channel1 transfer error flag.
*                      DMA1_IT_GL2: DMA1 Channel2 global flag.
*                      DMA1_IT_TC2: DMA1 Channel2 transfer complete flag.
*                      DMA1_IT_HT2: DMA1 Channel2 half transfer flag.
*                      DMA1_IT_TE2: DMA1 Channel2 transfer error flag.
*                      DMA1_IT_GL3: DMA1 Channel3 global flag.
*                      DMA1_IT_TC3: DMA1 Channel3 transfer complete flag.
*                      DMA1_IT_HT3: DMA1 Channel3 half transfer flag.
*                      DMA1_IT_TE3: DMA1 Channel3 transfer error flag.
*                      DMA1_IT_GL4: DMA1 Channel4 global flag.
*                      DMA1_IT_TC4: DMA1 Channel4 transfer complete flag.
*                      DMA1_IT_HT4: DMA1 Channel4 half transfer flag.
*                      DMA1_IT_TE4: DMA1 Channel4 transfer error flag.
*                      DMA1_IT_GL5: DMA1 Channel5 global flag.
*                      DMA1_IT_TC5: DMA1 Channel5 transfer complete flag.
*                      DMA1_IT_HT5: DMA1 Channel5 half transfer flag.
*                      DMA1_IT_TE5: DMA1 Channel5 transfer error flag.
*                      DMA1_IT_GL6: DMA1 Channel6 global flag.
*                      DMA1_IT_TC6: DMA1 Channel6 transfer complete flag.
*                      DMA1_IT_HT6: DMA1 Channel6 half transfer flag.
*                      DMA1_IT_TE6: DMA1 Channel6 transfer error flag.
*                      DMA1_IT_GL7: DMA1 Channel7 global flag.
*                      DMA1_IT_TC7: DMA1 Channel7 transfer complete flag.
*                      DMA1_IT_HT7: DMA1 Channel7 half transfer flag.
*                      DMA1_IT_TE7: DMA1 Channel7 transfer error flag.
*                      DMA2_IT_GL1: DMA2 Channel1 global flag.
*                      DMA2_IT_TC1: DMA2 Channel1 transfer complete flag.
*                      DMA2_IT_HT1: DMA2 Channel1 half transfer flag.
*                      DMA2_IT_TE1: DMA2 Channel1 transfer error flag.
*                      DMA2_IT_GL2: DMA2 Channel2 global flag.
*                      DMA2_IT_TC2: DMA2 Channel2 transfer complete flag.
*                      DMA2_IT_HT2: DMA2 Channel2 half transfer flag.
*                      DMA2_IT_TE2: DMA2 Channel2 transfer error flag.
*                      DMA2_IT_GL3: DMA2 Channel3 global flag.
*                      DMA2_IT_TC3: DMA2 Channel3 transfer complete flag.
*                      DMA2_IT_HT3: DMA2 Channel3 half transfer flag.
*                      DMA2_IT_TE3: DMA2 Channel3 transfer error flag.
*                      DMA2_IT_GL4: DMA2 Channel4 global flag.
*                      DMA2_IT_TC4: DMA2 Channel4 transfer complete flag.
*                      DMA2_IT_HT4: DMA2 Channel4 half transfer flag.
*                      DMA2_IT_TE4: DMA2 Channel4 transfer error flag.
*                      DMA2_IT_GL5: DMA2 Channel5 global flag.
*                      DMA2_IT_TC5: DMA2 Channel5 transfer complete flag.
*                      DMA2_IT_HT5: DMA2 Channel5 half transfer flag.
*                      DMA2_IT_TE5: DMA2 Channel5 transfer error flag.
* Return         : None
*********************************************************************************/   
void DMA_ClearITPendingBit(uint32_t DMAy_IT)
{
  if ((DMAy_IT & FLAG_Mask) != (uint32_t)RESET)
  {
    DMA2->INTFCR = DMAy_IT;
  }
  else
  {
    DMA1->INTFCR = DMAy_IT;
  }
}

